MarlinFirmware/Marlin/Marlin/src/HAL/STM32F1/HAL_N32.cpp
/**================================================================
 *        Library function: Start ADC conversion
================================================================*/
void ADC_EnableSoftwareStartConv(ADC_Module* NS_ADCx, uint32_t Cmd) {
  if (Cmd != 0)
    /* Enable the selected ADC conversion on external event and start the selected
       ADC conversion */
    NS_ADCx->CTRL2 |= CTRL2_EXT_TRIG_SWSTART_SET;
  else
    /* Disable the selected ADC conversion on external event and stop the selected
       ADC conversion */
    NS_ADCx->CTRL2 &= CTRL2_EXT_TRIG_SWSTART_RESET;
}

/**================================================================
 *        Library function: Get the ADC status logo bit
================================================================*/
uint32_t ADC_GetFlagStatus(ADC_Module* NS_ADCx, uint8_t ADC_FLAG) {
  uint32_t bitstatus = 0;

  /* Check the status of the specified ADC flag */
  if ((NS_ADCx->STS & ADC_FLAG) != (uint8_t)0)
    /* ADC_FLAG is set */
    bitstatus = 1;
  else
    /* ADC_FLAG is reset */
    bitstatus = 0;
  /* Return the ADC_FLAG status */
  return bitstatus;
}

/**================================================================
 *        Library function: Clear status logo bit
================================================================*/
void ADC_ClearFlag(ADC_Module* NS_ADCx, uint8_t ADC_FLAG) {
  /* Clear the selected ADC flags */
  NS_ADCx->STS &= ~(uint32_t)ADC_FLAG;
}

/**================================================================
 *        Library function: Get ADC sampling value
================================================================*/
uint16_t ADC_GetDat(ADC_Module* NS_ADCx) {
  /* Return the selected ADC conversion value */
  return (uint16_t)NS_ADCx->DAT;
}

////////////////////////////////////////////////////////////////////////////////

typedef struct {
  __IO uint32_t CR;         /* Completely compatible */
  __IO uint32_t CFGR;       /* Not compatible: ADC frequency is not set here */
  __IO uint32_t CIR;        /* Completely compatible */

  __IO uint32_t APB2RSTR;   /* Completely compatible */
  __IO uint32_t APB1RSTR;   /* Completely compatible */

  __IO uint32_t AHBENR;     /* Not compatible: ADC clock enables settings here */
  __IO uint32_t APB2ENR;    /* Not compatible: ADC clock enables to be here */
  __IO uint32_t APB1ENR;    /* compatible */
  __IO uint32_t BDCR;       /* compatible */
  __IO uint32_t CSR;        /* compatible */


  __IO uint32_t AHBRSTR;    /* Not compatible, ADC reset here settings */
  __IO uint32_t CFGR2;      /* Not compatible, ADC clock settings here */
  __IO uint32_t CFGR3;      /* Not compatible, add a new register */

} RCC_TypeDef;

#define RCC                 ((RCC_TypeDef *) ADC_RCC_BASE)

/**================================================================
 *        Initialize ADC clock
================================================================*/

void enable_adc_clk(uint8_t cmd) {
  uint32_t reg_temp;
  if (cmd) {
    /** 使能PWR时钟 */
    reg_temp           = ADC_RCC_APB1PCLKEN;
    reg_temp          |= RCC_APB1Periph_PWR;
    ADC_RCC_APB1PCLKEN = reg_temp;

    /** 使能拓展模式 */
    reg_temp   = NS_PWR_CR3;
    reg_temp  |= 0x00000001;
    NS_PWR_CR3 = reg_temp;

    /** 使能ADC时钟 */
    reg_temp  = ADC_RCC_AHBPCLKEN;
    reg_temp |= ( RCC_AHB_PERIPH_ADC1 |
                  RCC_AHB_PERIPH_ADC2 |
                  RCC_AHB_PERIPH_ADC3 |
                  RCC_AHB_PERIPH_ADC4   );
    ADC_RCC_AHBPCLKEN = reg_temp;

    /** 复位外设 */
    reg_temp  = ADC_RCC_AHBPRST;
    reg_temp |= ( RCC_AHB_PERIPH_ADC1 |
                  RCC_AHB_PERIPH_ADC2 |
                  RCC_AHB_PERIPH_ADC3 |
                  RCC_AHB_PERIPH_ADC4   );
    ADC_RCC_AHBPRST  = reg_temp;              // ADC模块复位置位
    ADC_RCC_AHBPRST &= ~reg_temp;             // ADC模块复位清除

    /** 设置ADC 1M时钟*/
    reg_temp  = ADC_RCC_CFG2;
    reg_temp &= CFG2_ADC1MSEL_RESET_MASK;     // HSI 作为ADC 1M时钟
    reg_temp &= CFG2_ADC1MPRES_RESET_MASK;
    reg_temp |= 7 << 11;                      // ADC1M 8M/8=1M

    /** 设置ADC PLL分频系数 */
    reg_temp &= CFG2_ADCPLLPRES_RESET_MASK;
    reg_temp |= RCC_ADCPLLCLK_DIV4;           // ADC PLL分频系数

    /** 设置ADC HCLK分频系数 */
    reg_temp    &= CFG2_ADCHPRES_RESET_MASK;
    reg_temp    |= RCC_ADCHCLK_DIV4;          // ADC HCLK分频系数
    ADC_RCC_CFG2 = reg_temp;                  // 写入寄存器
  }
  else {
    /** 关闭ADC时钟 */
    reg_temp  = ADC_RCC_AHBPCLKEN;
    reg_temp &= ~(  RCC_AHB_PERIPH_ADC1 |
                    RCC_AHB_PERIPH_ADC2 |
                    RCC_AHB_PERIPH_ADC3 |
                    RCC_AHB_PERIPH_ADC4   );
    ADC_RCC_AHBPCLKEN = reg_temp;
  }

}

/**================================================================
 *        Initialize ADC peripheral parameters
================================================================*/
void ADC_Initial(ADC_Module* NS_ADCx) {
  ADC_InitType ADC_InitStructure;

  /* ADC configuration ------------------------------------------------------*/
  ADC_InitStructure.WorkMode       = ADC_WORKMODE_INDEPENDENT;    // 独立模式
  ADC_InitStructure.MultiChEn      = 1;                           // 多通道使能
  ADC_InitStructure.ContinueConvEn = 1;                           // 连续使能
  ADC_InitStructure.ExtTrigSelect  = ADC_EXT_TRIGCONV_NONE;       // 无触发
  ADC_InitStructure.DatAlign       = ADC_DAT_ALIGN_R;             // 右对齐
  ADC_InitStructure.ChsNumber      = 2;                           // 扫描通道数
  ADC_Init(NS_ADCx, &ADC_InitStructure);

  /* ADC regular channel14 configuration */
  ADC_ConfigRegularChannel(NS_ADCx, ADC2_Channel_05_PC4, 2, ADC_SAMP_TIME_55CYCLES5);
  ADC_ConfigRegularChannel(NS_ADCx, ADC2_Channel_12_PC5, 1, ADC_SAMP_TIME_55CYCLES5);

  /** 使能ADC DMA */
  ADC_EnableDMA(NS_ADCx, 1);

  /* Enable ADC */
  ADC_Enable(NS_ADCx, 1);
  while(ADC_GetFlagStatusNew(NS_ADCx, ADC_FLAG_RDY) == 0);

  /* Start ADC calibration */
  ADC_StartCalibration(NS_ADCx);
  while (ADC_GetCalibrationStatus(NS_ADCx));

  /* Start ADC Software Conversion */
  ADC_EnableSoftwareStartConv(NS_ADCx, 1);
}

