MarlinFirmware/Marlin/Marlin/src/HAL/STM32F1/HAL_N32.cpp
/**================================================================
 *        Single independent sampling
================================================================*/
uint16_t ADC_GetData(ADC_Module* NS_ADCx, uint8_t ADC_Channel) {
  uint16_t dat;

  /** Set channel parameters */
  ADC_ConfigRegularChannel(NS_ADCx, ADC_Channel, 1, ADC_SAMP_TIME_239CYCLES5);

  /* Start ADC Software Conversion */
  ADC_EnableSoftwareStartConv(NS_ADCx, 1);
  while(ADC_GetFlagStatus(NS_ADCx, ADC_FLAG_ENDC) == 0);

  ADC_ClearFlag(NS_ADCx, ADC_FLAG_ENDC);
  ADC_ClearFlag(NS_ADCx, ADC_FLAG_STR);
  dat = ADC_GetDat(NS_ADCx);
  return dat;
}

void DMA_DeInit(DMA_ChannelType* DMAyChx) {

  /* Disable the selected DMAy Channelx */
  DMAyChx->CHCFG &= (uint16_t)(~DMA_CHCFG1_CHEN);

  /* Reset DMAy Channelx control register */
  DMAyChx->CHCFG = 0;

  /* Reset DMAy Channelx remaining bytes register */
  DMAyChx->TXNUM = 0;

  /* Reset DMAy Channelx peripheral address register */
  DMAyChx->PADDR = 0;

  /* Reset DMAy Channelx memory address register */
  DMAyChx->MADDR = 0;

  if (DMAyChx == DMA1_CH1) {
    /* Reset interrupt pending bits for DMA1 Channel1 */
    DMA1->INTCLR |= DMA1_CH1_INT_MASK;
  }
  else if (DMAyChx == DMA1_CH2) {
    /* Reset interrupt pending bits for DMA1 Channel2 */
    DMA1->INTCLR |= DMA1_CH2_INT_MASK;
  }
  else if (DMAyChx == DMA1_CH3) {
    /* Reset interrupt pending bits for DMA1 Channel3 */
    DMA1->INTCLR |= DMA1_CH3_INT_MASK;
  }
  else if (DMAyChx == DMA1_CH4) {
    /* Reset interrupt pending bits for DMA1 Channel4 */
    DMA1->INTCLR |= DMA1_CH4_INT_MASK;
  }
  else if (DMAyChx == DMA1_CH5) {
    /* Reset interrupt pending bits for DMA1 Channel5 */
    DMA1->INTCLR |= DMA1_CH5_INT_MASK;
  }
  else if (DMAyChx == DMA1_CH6) {
    /* Reset interrupt pending bits for DMA1 Channel6 */
    DMA1->INTCLR |= DMA1_CH6_INT_MASK;
  }
  else if (DMAyChx == DMA1_CH7) {
    /* Reset interrupt pending bits for DMA1 Channel7 */
    DMA1->INTCLR |= DMA1_CH7_INT_MASK;
  }
  else if (DMAyChx == DMA1_CH8) {
    /* Reset interrupt pending bits for DMA1 Channel8 */
    DMA1->INTCLR |= DMA1_CH8_INT_MASK;
  }
  else if (DMAyChx == DMA2_CH1) {
    /* Reset interrupt pending bits for DMA2 Channel1 */
    DMA2->INTCLR |= DMA2_CH1_INT_MASK;
  }
  else if (DMAyChx == DMA2_CH2) {
    /* Reset interrupt pending bits for DMA2 Channel2 */
    DMA2->INTCLR |= DMA2_CH2_INT_MASK;
  }
  else if (DMAyChx == DMA2_CH3) {
    /* Reset interrupt pending bits for DMA2 Channel3 */
    DMA2->INTCLR |= DMA2_CH3_INT_MASK;
  }
  else if (DMAyChx == DMA2_CH4) {
    /* Reset interrupt pending bits for DMA2 Channel4 */
    DMA2->INTCLR |= DMA2_CH4_INT_MASK;
  }
  else if (DMAyChx == DMA2_CH5) {
    /* Reset interrupt pending bits for DMA2 Channel5 */
    DMA2->INTCLR |= DMA2_CH5_INT_MASK;
  }
  else if (DMAyChx == DMA2_CH6) {
    /* Reset interrupt pending bits for DMA2 Channel6 */
    DMA2->INTCLR |= DMA2_CH6_INT_MASK;
  }
  else if (DMAyChx == DMA2_CH7) {
    /* Reset interrupt pending bits for DMA2 Channel7 */
    DMA2->INTCLR |= DMA2_CH7_INT_MASK;
  }
  else if (DMAyChx == DMA2_CH8)
    /* Reset interrupt pending bits for DMA2 Channel8 */
    DMA2->INTCLR |= DMA2_CH8_INT_MASK;
}

#define CCR_CLEAR_Mask ((uint32_t)0xFFFF800F)

void DMA_Init(DMA_ChannelType* DMAyChx, DMA_InitType* DMA_InitParam) {
  uint32_t tmpregister = 0;

  /*--------------------------- DMAy Channelx CHCFG Configuration --------------*/
  /* Get the DMAyChx CHCFG value */
  tmpregister = DMAyChx->CHCFG;
  /* Clear MEM2MEM, PL, MSIZE, PSIZE, MINC, PINC, CIRC and DIR bits */
  tmpregister &= CCR_CLEAR_Mask;
  /* Configure DMAy Channelx: data transfer, data size, priority level and mode */
  /* Set DIR bit according to Direction value */
  /* Set CIRC bit according to CircularMode value */
  /* Set PINC bit according to PeriphInc value */
  /* Set MINC bit according to DMA_MemoryInc value */
  /* Set PSIZE bits according to PeriphDataSize value */
  /* Set MSIZE bits according to MemDataSize value */
  /* Set PL bits according to Priority value */
  /* Set the MEM2MEM bit according to Mem2Mem value */
  tmpregister |= DMA_InitParam->Direction | DMA_InitParam->CircularMode | DMA_InitParam->PeriphInc
               | DMA_InitParam->DMA_MemoryInc | DMA_InitParam->PeriphDataSize | DMA_InitParam->MemDataSize
               | DMA_InitParam->Priority | DMA_InitParam->Mem2Mem;

  /* Write to DMAy Channelx CHCFG */
  DMAyChx->CHCFG = tmpregister;

  /*--------------------------- DMAy Channelx TXNUM Configuration --------------*/
  /* Write to DMAy Channelx TXNUM */
  DMAyChx->TXNUM = DMA_InitParam->BufSize;

  /*--------------------------- DMAy Channelx PADDR Configuration --------------*/
  /* Write to DMAy Channelx PADDR */
  DMAyChx->PADDR = DMA_InitParam->PeriphAddr;

  /*--------------------------- DMAy Channelx MADDR Configuration --------------*/
  /* Write to DMAy Channelx MADDR */
  DMAyChx->MADDR = DMA_InitParam->MemAddr;
}

void DMA_EnableChannel(DMA_ChannelType* DMAyChx, uint32_t Cmd) {
  if (Cmd != 0) {
    /* Enable the selected DMAy Channelx */
    DMAyChx->CHCFG |= DMA_CHCFG1_CHEN;
  }
  else {
    /* Disable the selected DMAy Channelx */
    DMAyChx->CHCFG &= (uint16_t)(~DMA_CHCFG1_CHEN);
  }
}

#define USE_ADC       NS_ADC2
#define USE_DMA_CH    DMA1_CH8

/**================================================================
 *        Initialize the DMA of ADC
================================================================*/
void ADC_DMA_init(void) {
  DMA_InitType DMA_InitStructure;
  uint32_t reg_temp;

  /** Make DMA clock */
  reg_temp = ADC_RCC_AHBPCLKEN;
  reg_temp |= ( RCC_AHB_PERIPH_DMA1 |
                RCC_AHB_PERIPH_DMA2    );
  ADC_RCC_AHBPCLKEN = reg_temp;

  /* DMA channel configuration*/
  DMA_DeInit(USE_DMA_CH);
  DMA_InitStructure.PeriphAddr     = (uint32_t)&USE_ADC->DAT;
  DMA_InitStructure.MemAddr        = (uint32_t)adc_results;
  DMA_InitStructure.Direction      = DMA_DIR_PERIPH_SRC;            // Peripheral-> memory
  DMA_InitStructure.BufSize        = 2;
  DMA_InitStructure.PeriphInc      = DMA_PERIPH_INC_DISABLE;
  DMA_InitStructure.DMA_MemoryInc  = DMA_MEM_INC_ENABLE;            // Memory ++
  DMA_InitStructure.PeriphDataSize = DMA_PERIPH_DATA_SIZE_HALFWORD;
  DMA_InitStructure.MemDataSize    = DMA_MemoryDataSize_HalfWord;
  DMA_InitStructure.CircularMode   = DMA_MODE_CIRCULAR;
  DMA_InitStructure.Priority       = DMA_PRIORITY_HIGH;
  DMA_InitStructure.Mem2Mem        = DMA_M2M_DISABLE;
  DMA_Init(USE_DMA_CH, &DMA_InitStructure);

  /* Enable DMA channel1 */
  DMA_EnableChannel(USE_DMA_CH, 1);
}

/**=============================================================================
 *        n32g452 - end
==============================================================================*/

// ------------------------
// Serial ports
// ------------------------

